
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/11869157362)



<pre><code>Error: POST https://api.github.com/user/repos: 403 Resource not accessible by integration []

  with module.repositories[&#34;composite-actions&#34;].github_repository.this,
  on module/repository/main.tf line 1, in resource &#34;github_repository&#34; &#34;this&#34;:
   1: resource &#34;github_repository&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["devcontainer-features"].github_branch.default: Refreshing state... [id=devcontainer-features:main]
module.repositories["dyson-rs"].github_branch.default: Refreshing state... [id=dyson-rs:master]
module.repositories["json-with-comments"].github_branch.default: Refreshing state... [id=json-with-comments:master]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["devcontainer-features"].github_repository_file.readme: Refreshing state... [id=devcontainer-features/README.md]
module.repositories["dyson-rs"].github_repository_file.readme: Refreshing state... [id=dyson-rs/README.md]
module.repositories["tfgh"].github_repository_file.readme: Refreshing state... [id=tfgh/README.md]
module.repositories["json-with-comments"].github_repository_file.readme: Refreshing state... [id=json-with-comments/README.md]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:42]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:10]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:65]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:45]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"34b0604b7f56e6bbb0a1a05e35dcb6028ff0023aa0a2317196bcde290b249b48\"" -> "W/\"63a57839f6f602ea3207e08ed110b849c72606e8dd3acfb98ab174f7a9fe89df\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"118ea29a87328f43a7a63467b11b0eb1fa003c6b16aa6331d45ee3847819d44f\"" -> "W/\"afe4ca9f29bc35e928eb3591c27d18ec4034f8308576e6fa199d41d4ed95ca24\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"d9894988eb03aa6a3fd4f63ed9ffa87d6df374cad46a63aa9961a2f22ea1db6b\"" -> "W/\"20dee959abee48846ac0d8e3e71dabf9219564f5f711da410bdd0803ba945ee1\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9906f46cad51f211c4a31418adeb1c350722af4180805f4431dd03e3dacdf932\"" -> "W/\"f1b5fcd4359644a70677e200d48ca1052c2ff4c394cf85a737839a604c1c3c73\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["composite-actions"].github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "composite-actions"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repositories["composite-actions"].github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "composite-actions"
    }

  # module.repositories["composite-actions"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "composite-actions"
      + url         = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "composite-actions"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # composite-actions
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "composite-actions"
      + sha                             = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "composite-actions"
      + sha                          = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "composite-actions"
      + sha                          = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Overview :rocket:
            > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "composite-actions"
      + sha                          = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "composite-actions"
      + sha                          = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "composite-actions"
      + sha                          = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "main"
      + base_repository       = "composite-actions"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["composite-actions"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "composite-actions"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.
module.repositories["composite-actions"].github_repository.this: Creating...

Error: POST https://api.github.com/user/repos: 403 Resource not accessible by integration []

  with module.repositories["composite-actions"].github_repository.this,
  on module/repository/main.tf line 1, in resource "github_repository" "this":
   1: resource "github_repository" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":69,"Program":"tfcmt","SHA1":"c9a81dbab2f1f785747b5c71c2c11b66c2111465","Vars":{},"WorkflowName":"Terraform apply on push"} -->